### Подключение необходимых библиотек

In [150]:
import numpy as np
import pandas as pd

### Загрузка данных

In [157]:
baby_names = pd.read_csv("US_Baby_Names_right.csv")
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Описание данных

Unnamed - Порядковый номер -1

ID - порядковый номер

Name - имя ребёнка

Year - Год рождения

Gender - пол ребёнка

State - штат рождения

Count - Количество с таким именем

In [23]:
#Количество строк, и количество столбцов
baby_names.shape

(1016395, 7)

In [24]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [25]:
#Преобразование в float формат
np.set_printoptions(suppress=True)
pd.set_option('display.float_format', lambda x: '%0.4f' % x)
baby_names.describe()

        Unnamed: 0           Id         Year        Count
count 1016395.0000 1016395.0000 1016395.0000 1016395.0000
mean  2830990.4619 2830991.4619    2009.0532      34.8501
std   1652475.6515 1652475.6515       3.1383      97.3973
min     11349.0000   11350.0000    2004.0000       5.0000
25%   1317326.5000 1317327.5000    2006.0000       7.0000
50%   2811920.0000 2811921.0000    2009.0000      11.0000
75%   4242554.5000 4242555.5000    2012.0000      26.0000
max   5647425.0000 5647426.0000    2014.0000    4167.0000

In [27]:
baby_names.describe(include=["O"])

           Name   Gender    State
count   1016395  1016395  1016395
unique    17632        2       51
top       Riley        F       CA
freq       1112   558846    76781

In [29]:
baby_names["State"].describe(include=["0"])

count     1016395
unique         51
top            CA
freq        76781
Name: State, dtype: object

### Предварительная обработка данных

#### Удаление столблоц, с последующем присвоение inplace - он позволяет присвоить изменения

In [20]:

baby_names.drop(axis=1, columns=["Unnamed: 0", "Id"], inplace=True)

#### Раздел на пустые значения

In [23]:
baby_names.isnull().sum()

Name      0
Year      0
Gender    0
State     0
Count     0
dtype: int64

In [25]:
baby_names.isna().sum()

Name      0
Year      0
Gender    0
State     0
Count     0
dtype: int64

#### Проверка на дубликаты

In [28]:
baby_names.duplicated().sum()

0

In [30]:
baby_names.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
1016390    False
1016391    False
1016392    False
1016393    False
1016394    False
Length: 1016395, dtype: bool

#### Удаление дублирующих значений

In [33]:
baby_names.drop_duplicates()

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

# Домашнее задание

## Пять наибольших значений

In [37]:
baby_names.nlargest(5, ["Count"])

           Name  Year Gender State  Count
107416   Daniel  2004      M    CA   4167
110097   Daniel  2005      M    CA   3914
115739   Daniel  2007      M    CA   3865
112872   Daniel  2006      M    CA   3826
107417  Anthony  2004      M    CA   3805

In [57]:
baby_names.nlargest(5, ["Year"])

          Name  Year Gender State  Count
2173      Emma  2014      F    AK     50
2174    Olivia  2014      F    AK     47
2175    Sophia  2014      F    AK     43
2176    Aurora  2014      F    AK     35
2177  Isabella  2014      F    AK     33

## 5 наименьших значений из таблицы

In [65]:
baby_names.nsmallest(5, ["Count"])

          Name  Year Gender State  Count
166   Adrianna  2004      F    AK      5
167      Alice  2004      F    AK      5
168     Aliyah  2004      F    AK      5
169      Amaya  2004      F    AK      5
170  Anastasia  2004      F    AK      5

In [67]:
baby_names.nsmallest(5, ["Year"])

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

## Вывод последних элементов

In [86]:
baby_names.tail(5)

            Name  Year Gender State  Count
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

## Вывод уникальный строк

In [99]:
len(baby_names["Count"].unique())

1949

In [148]:
unique_names = baby_names["Count"].unique()
smallest_names = unique_names[:10] 
print([smallest_names])

[array([62, 48, 46, 44, 41, 37, 33, 30, 29, 28], dtype=int64)]

In [158]:
baby_names.value_counts()

Name      Year  Gender  State  Count
Aaban     2013  M       NY     6        1
Luis      2010  M       WA     122      1
                        NM     60       1
                        NV     92       1
                        NY     235      1
                                       ..
Emmerie   2009  F       TX     5        1
Emmerson  2005  F       CA     6        1
                        MI     6        1
                        TX     7        1
Zyriah    2014  F       TX     6        1
Name: count, Length: 1016395, dtype: int64

## Выбор строк и столбцов на основе их позиции

In [167]:
baby_names.iloc[0:3]

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46

## Фильтрация по названию по столбцу

In [175]:
select_row = baby_names.loc[baby_names["Name"].isin(["Emma", "Hannah"])]
select_row

           Name  Year Gender State  Count
0          Emma  2004      F    AK     62
2        Hannah  2004      F    AK     46
205        Emma  2005      F    AK     49
209      Hannah  2005      F    AK     34
418        Emma  2006      F    AK     49
...         ...   ...    ...   ...    ...
1014114  Hannah  2012      F    WY     19
1014222    Emma  2013      F    WY     30
1014254  Hannah  2013      F    WY     10
1014362    Emma  2014      F    WY     32
1014379  Hannah  2014      F    WY     13

[1128 rows x 5 columns]

In [186]:
baby_names[baby_names["Year"].isin([2005])]

             Name  Year Gender State  Count
204       Madison  2005      F    AK     53
205          Emma  2005      F    AK     49
206         Emily  2005      F    AK     47
207      Isabella  2005      F    AK     35
208      Samantha  2005      F    AK     35
...           ...   ...    ...   ...    ...
1014810    Travis  2005      M    WY      5
1014811   Trenton  2005      M    WY      5
1014812    Tucker  2005      M    WY      5
1014813   Vincent  2005      M    WY      5
1014814    Xander  2005      M    WY      5

[88494 rows x 5 columns]

In [188]:
baby_names[baby_names["Year"] == 2005]

             Name  Year Gender State  Count
204       Madison  2005      F    AK     53
205          Emma  2005      F    AK     49
206         Emily  2005      F    AK     47
207      Isabella  2005      F    AK     35
208      Samantha  2005      F    AK     35
...           ...   ...    ...   ...    ...
1014810    Travis  2005      M    WY      5
1014811   Trenton  2005      M    WY      5
1014812    Tucker  2005      M    WY      5
1014813   Vincent  2005      M    WY      5
1014814    Xander  2005      M    WY      5

[88494 rows x 5 columns]

## Числовая сортировка

In [192]:
baby_names.sort_values("Count", ascending=False)

             Name  Year Gender State  Count
107416     Daniel  2004      M    CA   4167
110097     Daniel  2005      M    CA   3914
115739     Daniel  2007      M    CA   3865
112872     Daniel  2006      M    CA   3826
107417    Anthony  2004      M    CA   3805
...           ...   ...    ...   ...    ...
470218        Gus  2005      M    MI      5
470217   Giuseppe  2005      M    MI      5
470216   Garrison  2005      M    MI      5
470215     Garett  2005      M    MI      5
1016394    Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

## Подсчет количеств записей по названию столбца

In [206]:
baby_names.groupby("Name").count()

         Year  Gender  State  Count
Name
Aaban       2       2      2      2
Aadan       4       4      4      4
Aadarsh     1       1      1      1
Aaden     196     196    196    196
Aadhav      1       1      1      1
...       ...     ...    ...    ...
Zyra        7       7      7      7
Zyrah       2       2      2      2
Zyren       1       1      1      1
Zyria      10      10     10     10
Zyriah      9       9      9      9

[17632 rows x 4 columns]

## Отбор случайных записей, в заданном диопазоне

In [222]:
baby_names.sample(frac=0.0001)

           Name  Year Gender State  Count
1477      Keira  2010      F    AK      5
496496    Kasey  2009      M    MN      6
97035   Jamilet  2012      F    CA     16
154637    Ryder  2009      M    CO     82
678685   Callum  2006      M    NY     10
...         ...   ...    ...   ...    ...
200745   Yadira  2011      F    FL     10
486794   Janiya  2009      F    MN      6
893261   Tucker  2007      M    TX     85
726358    Scott  2013      M    OH     34
407448     Anne  2005      F    MA     20

[102 rows x 5 columns]

## Подсчет количества

In [228]:
baby_names[baby_names["Gender"] == "F"].count()

Name      558846
Year      558846
Gender    558846
State     558846
Count     558846
dtype: int64

In [34]:
baby_names[baby_names["Gender"] == "M"].count()

Unnamed: 0    457549
Id            457549
Name          457549
Year          457549
Gender        457549
State         457549
Count         457549
dtype: int64

## Метериал урока 07102024

## Рождение детей в определённый год

In [38]:
baby_names[baby_names["Year"] == 2004]["Count"].sum()

3293984

## Отображение мужчин и женщин

In [42]:
count = baby_names["Gender"].value_counts()
count

Gender
F    558846
M    457549
Name: count, dtype: int64

In [48]:
baby_names[["Gender","Count"]].groupby("Gender").sum()

           Count
Gender
F       16380293
M       19041199

In [62]:
baby_names[["Year","Count"]].groupby("Year").sum()

        Count
Year
2004  3293984
2005  3305315
2006  3387737
2007  3412417
2008  3340318
2009  3232116
2010  3116548
2011  3079145
2012  3073858
2013  3066443
2014  3113611

In [73]:
baby_names[["State", "Count"]].groupby("State").sum().sort_values("Count", ascending=False)

         Count
State
CA     5084647
TX     3791675
NY     2208154
FL     1976379
IL     1486991
OH     1286370
PA     1276091
GA     1185168
NC     1078680
MI     1038080
NJ      913330
VA      872376
AZ      808258
IN      753487
TN      735102
WA      730321
MO      672772
MA      638232
MN      595801
MD      585246
WI      576679
CO      574230
LA      493505
AL      475422
KY      460790
UT      448216
SC      435359
OK      413580
OR      381556
KS      327040
IA      318773
CT      312747
AR      292659
MS      288143
NV      279767
NE      201367
NM      198657
WV      167357
ID      167128
NH      101547
ME       99368
HI       90406
RI       83499
DC       82504
SD       79547
MT       75765
DE       73060
ND       69561
AK       63649
VT       36432
WY       36019

In [87]:
baby_names[["Name", "Count"]].groupby("Name").sum().sort_values("Count", ascending=False)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

In [99]:
baby_names[["State","Name", "Count"]].groupby(["State", "Name"]).sum().sort_values("Count", ascending=False)

                  Count
State Name
CA    Daniel      36772
      Anthony     34113
      Jacob       33819
      Angel       31881
      Isabella    31492
...                 ...
FL    Kaniah          5
CO    Judson          5
MN    Abdishakur      5
TX    Ary             5
GA    Brittani        5

[167628 rows x 1 columns]

In [115]:
state_name = baby_names[["State","Name", "Count"]].groupby(["State","Name"]).sum().sort_values("Count", ascending=False).reset_index()
state_name

       State        Name  Count
0         CA      Daniel  36772
1         CA     Anthony  34113
2         CA       Jacob  33819
3         CA       Angel  31881
4         CA    Isabella  31492
...      ...         ...    ...
167623    FL      Kaniah      5
167624    CO      Judson      5
167625    MN  Abdishakur      5
167626    TX         Ary      5
167627    GA    Brittani      5

[167628 rows x 3 columns]

In [117]:
state_name[state_name["State"] == "FL"]

       State      Name  Count
59        FL  Isabella  16834
95        FL   Michael  13482
109       FL     Jacob  12889
113       FL    Joshua  12582
118       FL    Sophia  12448
...      ...       ...    ...
167380    FL     Kalee      5
167424    FL     Kaori      5
167540    FL     Kamea      5
167601    FL    Kanard      5
167623    FL    Kaniah      5

[7438 rows x 3 columns]

In [128]:
state_name[state_name["Name"] == "Jacob"]

      State   Name  Count
2        CA  Jacob  33819
19       TX  Jacob  23574
89       NY  Jacob  14161
109      FL  Jacob  12889
197      IL  Jacob   9878
208      OH  Jacob   9512
210      PA  Jacob   9475
292      MI  Jacob   8102
323      NC  Jacob   7656
365      GA  Jacob   7211
483      VA  Jacob   6284
595      NJ  Jacob   5645
603      TN  Jacob   5611
644      AZ  Jacob   5407
683      IN  Jacob   5261
780      MA  Jacob   4917
811      MO  Jacob   4836
883      WA  Jacob   4597
986      KY  Jacob   4310
1108     MD  Jacob   4022
1173     MN  Jacob   3907
1179     WI  Jacob   3899
1357     AL  Jacob   3572
1378     CO  Jacob   3540
1655     SC  Jacob   3138
1926     UT  Jacob   2845
1955     OK  Jacob   2819
2052     LA  Jacob   2723
2340     CT  Jacob   2478
2424     OR  Jacob   2418
2744     KS  Jacob   2220
2855     IA  Jacob   2140
2917     AR  Jacob   2112
3005     NV  Jacob   2061
3280     MS  Jacob   1931
3475     WV  Jacob   1843
4216     NM  Jacob   1570
4520     NE  Jacob   1481
6237     NH  Jacob   1119
6294     ID  Jacob   1108
7225     ME  Jacob    968
8258     RI  Jacob    854
9869     HI  Jacob    719
10484    SD  Jacob    678
11132    DE  Jacob    634
11472    MT  Jacob    614
12350    ND  Jacob    568
13566    AK  Jacob    515
14626    DC  Jacob    474
15788    VT  Jacob    437
20675    WY  Jacob    322

In [138]:
state_name = baby_names[["Name", "Count"]].groupby(["Name"]).sum().sort_values("Count")
state_name

           Count
Name
Destenie       5
Janisha        5
Lizvet         5
Arsalan        5
Janira         5
...          ...
Isabella  204798
Ethan     209277
Michael   214405
Emma      214852
Jacob     242874

[17632 rows x 1 columns]

In [148]:
name = baby_names[["Name", "Count"]].groupby(["Name"]).sum().sort_values("Count").reset_index()
name[name["Count"] == 5]

             Name  Count
0        Destenie      5
1         Janisha      5
2          Lizvet      5
3         Arsalan      5
4          Janira      5
...           ...    ...
2573   Alyxandria      5
2574  Ethanjoseph      5
2575       Almira      5
2576     Davarion      5
2577         Xoey      5

[2578 rows x 2 columns]